dofile ("./src/patterns/operations.lua")

-- базовый шаблон для человека.
human_pat = {
    ["СЛ"] = 10,
    ["ЛВ"] = 10,
    ["ИН"] = 10,
    ["ЗД"] = 10,
    ["Телосложение"] = 3
}

-- мужской шаблон.
mal_pat = sum_pat (human_pat, {sex = "mal", ["СЛ"] = 1, ["ЛВ"] = -1})

-- женский шаблон.
fem_pat = sum_pat (human_pat, {sex = "fem", ["СЛ"] = -1, ["ЛВ"] = 1, ["ГР"] = 2})

--------------------------------------------------------------------------------
--                            Модифицирующие шаблоны                          --
--------------------------------------------------------------------------------
-- шаблон мага
mag_pat = {
    ["СЛ"] = -1,
    ["ЛВ"] = -1,
    ["ИН"] = 2,
    ["ЗД"] = -1
  }

-- шаблон спортсмена
athlete_pat = {
    ["СЛ"] = 1,
    ["ЛВ"] = 1,
    ["ИН"] = -1
}
