dofile ("./src/patterns/operations.lua")
dofile ("./src/random/eye_color.lua")

-- базовый шаблон для человека.
human_pattern = {
    St = 10,    -- сила
    Dx = 10,    -- ловкость
    Iq = 10,    -- интелект
    Ht = 10,    -- здоровье
    Gr = 170,   -- рост
    Bt = 3,     -- телосложение
    FA = 0,     -- страх/гнев 
    SH = 0,     -- печаль/счастье    
}

-- мужской шаблон.
mal_pattern = sum_pat (human_pattern, 
    {sex = "mal", St = 1, Dx = -1, Gr = 5, FA = 1})

-- женский шаблон.
fem_pattern = sum_pat (human_pattern, 
    {sex = "fem", St = -1, Dx = 1, Br = 2, Gr = -5, FA = -1})

--------------------------------------------------------------------------------
--                            Модифицирующие шаблоны                          --
--------------------------------------------------------------------------------
-- шаблон мага
mag_pat = {
    St = -1,
    Dx = -1,
    Iq = 2,
    Ht = -1
  }

-- шаблон спортсмена
athlete_pat = {
    St = 1,
    Dx = 1,
    Iq = -1
}
