dofile ("./src/patterns/operations.lua")

-- базовый шаблон для человека.
human_pat = {
    St = 10,    -- сила
    Dx = 10,    -- ловкость
    Iq = 10,    -- интелект
    Ht = 10,    -- здоровье
    Gr = 170,   -- рост
    Bt = 3      -- телосложение
}

-- мужской шаблон.
mal_pat = sum_pat (human_pat, 
    {sex = "mal", St = 1, Dx = -1, Gr = 5})

-- женский шаблон.
fem_pat = sum_pat (human_pat, 
    {sex = "fem", St = -1, Dx = 1, Br = 2, Gr = -5})

--------------------------------------------------------------------------------
--                            Модифицирующие шаблоны                          --
--------------------------------------------------------------------------------
-- шаблон мага
mag_pat = {
    St = -1,
    Dx = -1,
    Iq = 2,
    Ht = -1
  }

-- шаблон спортсмена
athlete_pat = {
    St = 1,
    Dx = 1,
    Iq = -1
}
